# SubTransaction Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SubTransaction Constructor
SubTransaction Class See Also
---
Instantiates a sub-transaction object
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public SubTransaction(
	Document document
)
```

Visual Basic
---
```text
Public Sub New ( _
	document As Document _
)
```

Visual C++
---
```text
public:
SubTransaction(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document for which this sub-transaction is going to be used.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SubTransaction Class
Autodesk.Revit.DB Namespace